In [17]:
import pandas as pd

In [ ]:
Pickling
Flat file
Clipboard
Excel
JSON
HTML
HDFStore: PyTables (HDF5)
Feather
Parquet
ORC
SAS
SPSS
SQL
Google BigQuery
STATA

###  CSV (Comma Seprated Value)

**CSV Create**

In [ ]:
df1=pd.DataFrame([['A',1,100],['B',2,200],['C',3,300],['D',4,400]],columns=['Name','Roll_No','Marks'])
df1.to_csv('_dataset/Pandas.csv',index=False)

**CSV Read**

In [ ]:
df1=pd.read_csv('_dataset/Pandas.csv',index_col ="Roll_No",)
df1

### XML

**XML Create**

In [ ]:
#pip install lxml
df1=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['Name','Roll No.','Marks'],index=['R1','R2','R3'])
df1.to_html('_dataset/Pandas.xml')

**XML Read**

In [ ]:
df1=pd.read_html('_dataset/Pandas.xml')
df1

### Json

**JSON Create**

In [ ]:
df1=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['Name','Roll No.','Marks'],index=['R1','R2','R3'])
df1.to_json('_dataset/Pandas.json')

**JSON Read**

In [ ]:
df1=pd.read_json('_dataset/Pandas.json')
df1

### Excel

In [ ]:
#pip install openpyxl
from pandas import ExcelWriter
from pandas import ExcelFile

**Excel Create**

In [ ]:
df1=pd.DataFrame([['a',1,500],['b',2,600],['c',3,700]],columns=['Name','Roll No.','Marks'],index=['R1','R2','R3'])
df2=pd.DataFrame([['d',1,500],['e',2,600],['f',3,700]],columns=['Name','Roll No.','Marks'],index=['R4','R5','R6'])

In [ ]:
writer = ExcelWriter('_dataset/Pandas.xlsx')
df1.to_excel(writer,'Sheet1',index=False)
df2.to_excel(writer,'Sheet2',index=False)
writer.save()

**Excel Read**

In [ ]:
pd.read_excel('_dataset/Pandas.xlsx')

In [ ]:
pd.read_excel(open('_dataset/Pandas.xlsx', 'rb'),sheet_name='Sheet1')

In [ ]:
pd.read_excel(open('_dataset/Pandas.xlsx', 'rb'),sheet_name='Sheet2')

## DataBase

In [22]:
#pip install sqlalchemy
from sqlalchemy import create_engine

**mysql**

In [39]:
import pymysql as sql
import getpass
password=getpass.getpass(prompt='Password: ', stream=None) 
con = DbCon.connect(host='localhost', user='root',  password=password, database='test-pandas',port=3306)
engine = create_engine('mysql+pymysql://root:MasterAdminSql@localhost/test-pandas')

**Sqlite3**

In [3]:
import sqlite3
con = sqlite3.connect('_db/example.db')
engine = create_engine(f"sqlite:///_db/example.db")

**df to db table**

In [27]:
df=pd.read_csv('_dataset/tips.csv')
df.head()

   total_bill   tip  gender smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [28]:
df.to_sql('tips',con=engine)

**db table to df**

In [30]:
df2=pd.read_sql('select * from tips',con)
df2.head()

   index  total_bill   tip  gender smoker  day    time  size
0      0       16.99  1.01  Female     No  Sun  Dinner     2
1      1       10.34  1.66    Male     No  Sun  Dinner     3
2      2       21.01  3.50    Male     No  Sun  Dinner     3
3      3       23.68  3.31    Male     No  Sun  Dinner     2
4      4       24.59  3.61  Female     No  Sun  Dinner     4